<?php

namespace Database\Seeders;

use App\Models\ProcedureTemplate;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        // $data =;
        // DB::connection('iso_dic')->table('procedure_template')->insert($data);
         
        ProcedureTemplate::create([
            'id' => 4,
            'title' => 'التعريفات',
            'content' => [
                [
                    'sequence' => '4-1',
                    'value' => 'شركة أسداف لخدمات الأعمال: ... ..........................................'
                ],
                [
                    'sequence' => '4-2',
                    'value' => 'سياق شركة أسداف لخدمات الأعمال: مجموعة من الموضوعات الداخلية والخارجية يمكن أن يكون لها تأثير على تحديد ووضع وتطوير أهداف إدارة والبيئة المؤثرة فيها.'
                ],
                [
                    'sequence' => '4-3',
                    'value' => 'الطرف المهتم: شخص او منظمة التي يمكن أن يؤثر أو يتأثر أو يعتبر نفسه متأثرا بأي قرار أو نشاط يخص إدارة بما فيها البيئة والعملاء.'
                ],
                [
                    'sequence' => '4-4',
                    'value' => 'القضايا والموضوعات الداخلية المثيرة للاهتمام: تنشأ من عوامل داخلية يمكن أن يكون لها تأثير على أعمال إدارة، وهذه الموضوعات يمكن أن تكون موضوعات تقنية أو مرتبطة بتحديد الموارد أو الثقافة السائدة داخل إدارة أو مرتبطة بالموظفين والعمال والإداريين داخل إدارة أو مرتبطة بنظام إدارة الجودة سواء كانت داخلية أو خارجية.'
                ],
                [
                    'sequence' => '4-5',
                    'value' => 'القضايا والموضوعات الخارجية المثيرة للاهتمام: تنشأ من عوامل خارجية يمكن أن يكون لها تأثيرا على أعمال إدارة، وهذه الموضوعات يمكن أن تكون مثل موضوعات المنافسة ودراسة المنافسين أو القوانين والتشريعات المحلية والدولية والتي من الممكن أن تؤثر على نشاط إدارة أو البيئة الداخلية أو المحيطة بها، وكذلك الحالة الاقتصادية المحلية والعالمية والأمن العام واستقرار الأوضاع الداخلية والخارجية.'
                ]
            ]
        ]);
        // $this->call(CitySeeder::class);
    }
}
